"""## Задача 8. Считалка
### Что нужно сделать
N человек, пронумерованных числами от 1 до N, стоят в кругу. Они начинают играть в считалку на выбывание, где каждый K-й по счёту человек выбывает из круга, после чего счёт продолжается со следующего за ним человека.

На вход подаётся количество человек N и номер K. Напишите программу, которая выводит число от 1 до N — это номер человека, который останется в кругу последним.

Пример:

```
Кол-во человек: 5
Какое число в считалке? 7
Значит, выбывает каждый 7-й человек

Текущий круг людей: [1, 2, 3, 4, 5]
Начало счёта с номера 1
Выбывает человек под номером 2

Текущий круг людей: [1, 3, 4, 5]
Начало счёта с номера 3
Выбывает человек под номером 5

Текущий круг людей: [1, 3, 4]
Начало счёта с номера 1
Выбывает человек под номером 1

Текущий круг людей: [3, 4]
Начало счёта с номера 3
Выбывает человек под номером 3

Остался человек под номером 4
```
### Что оценивается
- Результат вычислений корректен.
- Input содержит корректные приглашения для ввода. 
- Формат вывода соответствует примеру.
- Переменные и функции имеют значащие имена, не только a, b, c, d (подробнее об этом в видео 2.3).
"""
def delete_cycle(players, start, cycle):
    counter = 0

    while counter <= cycle:
        for member in players[start : len(players)]:
            counter += 1
            if counter == cycle:
                i_deleted = players.index(member)
            elif counter == cycle + 1:
                return i_deleted, member
        else:
            start = 0


players_count = int(input("Кол-во человек: "))
cycle = int(input("Какое число в считалке?: "))
print(f"Значит, выбывает каждый {cycle}-й человек")

members = list(range(1, players_count + 1))    #members init
start_point = [0, 1]    #index of deleted member, next member

while len(members) > 1:
    print(f"\nТекущий круг людей: {members}")
    print(f"Начало счёта с номера {start_point[1]}")
    start_point[0], start_point[1] = delete_cycle(members, start_point[0], cycle)
    print(f"Выбывает человек под номером {members[start_point[0]]}")

    del members[start_point[0]]
else:
    print(f"\nОстался человек под номером {members[0]}")
